[
  {
    "keywords": ["cotton soil", "soil measures", "soil condition", "cotton soil type"],
    "answer_en": "Cotton loves deep, well-drained sandy loam soil rich in organic matter. Ensure moderate moisture and avoid waterlogging for better yield.",
    "answer_ta": "பருத்திக்கு ஆழமான, நல்ல வடிகால் வசதியுள்ள மணல் கலந்த மண் சிறந்தது. நீர் நின்று விடாமல் கவனியுங்கள்.",
    "answer_hi": "कपास के लिए गहरी, उपजाऊ और अच्छी जल निकासी वाली दोमट मिट्टी सबसे अच्छी होती है। जलभराव से बचें।",
    "answer_es": "El algodón prefiere suelos profundos, bien drenados, tipo franco arenoso, ricos en materia orgánica. Mantenga humedad moderada y evite encharcamientos para mejor rendimiento.",
    "answer_fr": "Le coton préfère un sol profond, bien drainé, limoneux-sableux, riche en matière organique. Assurez une humidité modérée et évitez l'engorgement pour un meilleur rendement."
  },
  {
    "keywords": ["cotton pests", "cotton insects", "cotton disease", "inspect cotton"],
    "answer_en": "Common cotton pests include bollworm, aphids, and whiteflies. Monitor regularly and use IPM: neem-based pesticides, pheromone traps, and crop rotation.",
    "answer_ta": "பருத்தியில் பொதுவான பூச்சிகள்: பால் சரியானது, அஃபிட்கள் மற்றும் வெள்ளை ஈ. கண்காணித்து நீம் எண்ணெய், பெரோமோன் காப்புகள் மற்றும் பயிர் மாற்றத்தை பின்பற்றவும்.",
    "answer_hi": "कपास में आम कीट: बॉलवर्म, एफिड्स और सफेद मक्खी। नियमित निगरानी करें, नीम आधारित कीटनाशक, फेरोमोन ट्रैप और फसल चक्रीकरण का उपयोग करें।",
    "answer_es": "Plagas comunes del algodón: gusano del capullo, pulgones y mosca blanca. Monitoree regularmente y use manejo integrado: pesticidas a base de neem, trampas de feromonas y rotación de cultivos.",
    "answer_fr": "Les ravageurs courants du coton comprennent le ver du boll, les pucerons et la mouche blanche. Surveillez régulièrement et utilisez la lutte intégrée : pesticides à base de neem, pièges à phéromones et rotation des cultures."
  },
  {
    "keywords": ["cotton irrigation", "water cotton", "cotton watering schedule"],
    "answer_en": "Irrigate cotton every 7–10 days. Use soil moisture sensors if available. Avoid water stress during flowering and boll formation.",
    "answer_ta": "பருத்திக்கு 7–10 நாட்களுக்கு ஒருமுறை பாசனம் செய்யுங்கள். மலர்ச்சிக் காலத்தில் நீர் பற்றாக்குறை வரக்கூடாது.",
    "answer_hi": "कपास में 7–10 दिन के अंतराल पर सिंचाई करें। फूल आने और बॉल बनने के समय पानी की कमी न होने दें।",
    "answer_es": "Riegue el algodón cada 7–10 días. Use sensores de humedad del suelo si están disponibles. Evite estrés hídrico durante la floración y formación de cápsulas.",
    "answer_fr": "Irrigue le coton tous les 7–10 jours. Utilisez des capteurs d'humidité du sol si disponibles. Évitez le stress hydrique pendant la floraison et la formation des capsules."
  },
  {
    "keywords": ["paddy soil", "rice soil", "paddy growth", "rice growth"],
    "answer_en": "Paddy thrives in clayey or loamy soils that retain water. Levelled fields help maintain standing water for better grain filling.",
    "answer_ta": "நெல் களிமண் அல்லது லோமி மண்ணில் சிறப்பாக வளரும். சமமான நிலம் நீர் தக்க வைக்க உதவும்.",
    "answer_hi": "धान चिकनी या दोमट मिट्टी में अच्छा उगता है जो पानी रोक सके। समतल खेत जरूरी हैं।",
    "answer_es": "El arroz prospera en suelos arcillosos o francos que retienen agua. Campos nivelados ayudan a mantener el agua para un mejor llenado del grano.",
    "answer_fr": "Le riz prospère dans des sols argileux ou limoneux qui retiennent l'eau. Les champs nivelés aident à maintenir l'eau pour un meilleur remplissage des grains."
  },
  {
    "keywords": ["paddy pests", "rice pests", "rice disease"],
    "answer_en": "Common rice pests: stem borer, leaf folder, and brown planthopper. Use IPM: resistant varieties, timely pesticide application, and field sanitation.",
    "answer_ta": "நெல்லில் பொதுவான பூச்சிகள்: கம்பி கீடுகள், இலை சுருங்கும் பூச்சிகள் மற்றும் பழுப்பு நீர் ஈ. பாதுகாப்பு வகைகள் மற்றும் நேரடி பூச்சிமருந்து பயன்பாடு.",
    "answer_hi": "धान में आम कीट: तना छेदक, पत्ती फोल्डर और ब्राउन प्लांथॉपर। IPM अपनाएँ: प्रतिरोधी किस्में, समय पर कीटनाशक और खेत की सफाई।",
    "answer_es": "Plagas comunes del arroz: taladrador de tallos, enrollador de hojas y saltahojas marrón. Use manejo integrado: variedades resistentes, aplicación oportuna de pesticidas y saneamiento del campo.",
    "answer_fr": "Ravageurs courants du riz : foreur de tiges, plieur de feuilles et cicadelle brune. Utilisez la lutte intégrée : variétés résistantes, application ponctuelle de pesticides et assainissement des champs."
  },
  {
    "keywords": ["tomato soil", "tomato irrigation", "tomato growth", "tomato climate"],
    "answer_en": "Tomatoes love warm, sunny weather. Plant in well-drained soil with balanced fertilizer. Maintain 25–30°C during day and 18–20°C at night for optimal growth.",
    "answer_ta": "தக்காளி சாகுபடிக்கு வெப்பமான மற்றும் சூரிய ஒளியுள்ள சூழல் பிடிக்கும். நல்ல வடிகால் கொண்ட மண்ணில் நடவும், சமநிலை உரம் கொடுக்கவும். பகல் 25–30°C மற்றும் இரவு 18–20°C பராமரிக்கவும்.",
    "answer_hi": "टमाटर को गर्म और धूप वाला मौसम पसंद है। अच्छी जल निकासी वाली मिट्टी में लगाएँ और संतुलित उर्वरक दें। दिन में 25–30°C और रात में 18–20°C बनाए रखें।",
    "answer_es": "Los tomates prefieren clima cálido y soleado. Plante en suelos bien drenados con fertilización equilibrada. Mantenga 25–30°C durante el día y 18–20°C por la noche para crecimiento óptimo.",
    "answer_fr": "Les tomates aiment un temps chaud et ensoleillé. Plantez dans un sol bien drainé avec un engrais équilibré. Maintenez 25–30°C le jour et 18–20°C la nuit pour une croissance optimale."
  },
  {
    "keywords": ["tomato pests", "tomato disease", "tomato insects"],
    "answer_en": "Common pests: fruit borer, whitefly, leaf miner. Use neem oil, pheromone traps, and remove heavily infested plants.",
    "answer_ta": "பொதுவான பூச்சிகள்: பழச்சிவப்பு, வெள்ளை ஈ, இலை சுருங்கல். நீம் எண்ணெய் மற்றும் பெரோமோன் காப்புகள் பயன்படுத்தவும்.",
    "answer_hi": "आम कीट: फल छेदक, सफेद मक्खी, पत्ती खनन करने वाले। नीम तेल, फेरोमोन ट्रैप और संक्रमित पौध हटाएँ।",
    "answer_es": "Plagas comunes: taladrador de fruto, mosca blanca, minador de hojas. Use aceite de neem, trampas de feromonas y retire plantas muy infestadas.",
    "answer_fr": "Ravageurs courants : foreur de fruits, mouche blanche, mineuse des feuilles. Utilisez de l'huile de neem, des pièges à phéromones et retirez les plantes fortement infestées."
  },
  {
    "keywords": ["sugarcane fertilizer", "fertilizer sugarcane", "sugarcane nutrition"],
    "answer_en": "Sugarcane needs about 340 kg N, 170 kg P2O5, and 170 kg K2O per hectare. Split nitrogen in 3 doses and irrigate regularly.",
    "answer_ta": "கரும்புக்கு அதிக ஊட்டச்சத்து தேவை. நைட்ரஜன் 3 பிரிவாக கொடுக்கவும் மற்றும் பாசனம் முறையாக செய்யவும்.",
    "answer_hi": "गन्ने को लगभग 340 किग्रा N, 170 किग्रा P2O5 और 170 किग्रा K2O प्रति हेक्टेयर चाहिए। नाइट्रोजन को तीन भागों में दें और नियमित सिंचाई करें।",
    "answer_es": "La caña de azúcar necesita aproximadamente 340 kg N, 170 kg P2O5 y 170 kg K2O por hectárea. Divida el nitrógeno en 3 aplicaciones y riegue regularmente.",
    "answer_fr": "La canne à sucre nécessite environ 340 kg N, 170 kg P2O5 et 170 kg K2O par hectare. Répartissez l'azote en 3 doses et arrosez régulièrement."
  },
  {
    "keywords": ["banana irrigation", "banana water", "banana watering schedule"],
    "answer_en": "Banana needs frequent irrigation every 3–4 days in summer and 7 days in winter. Drip irrigation is recommended.",
    "answer_ta": "வாழைக்கு கோடையில் 3–4 நாட்களுக்கு ஒருமுறை, குளிர்காலத்தில் 7 நாட்களுக்கு ஒருமுறை நீர் கொடுக்கவும். டிரிப் பாசனம் சிறந்தது.",
    "answer_hi": "केले में गर्मी में हर 3–4 दिन और सर्दी में 7 दिन पर सिंचाई करें। ड्रिप सिंचाई सर्वोत्तम है।",
    "answer_es": "El plátano necesita riego frecuente cada 3–4 días en verano y 7 días en invierno. Se recomienda riego por goteo.",
    "answer_fr": "La banane nécessite un arrosage fréquent tous les 3–4 jours en été et tous les 7 jours en hiver. L'irrigation goutte-à-goutte est recommandée."
  }
]
